[7025_IT_2025-04-15.txt](https://github.com/user-attachments/files/19767161/7025_IT_2025-04-15.txt)

## TF plan for dev.shared

```
Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.blocked_user_agents will be created
  + resource "aws_wafv2_regex_pattern_set" "blocked_user_agents" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "azul-blocked_user_agents-dev"
      + scope      = "REGIONAL"
      + tags       = {
          + "Name"                = "azul-blocked_user_agents"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all   = {
          + "Name"                = "azul-blocked_user_agents"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }

      + regular_expression {
          + regex_string = "UAEmdDd991fowvU7Kc-RVc3LUfU7cmcjwBg"
        }
      + regular_expression {
          + regex_string = "aria2"
        }
    }

  # aws_wafv2_regex_pattern_set.blocked_user_agents_custom will be created
  + resource "aws_wafv2_regex_pattern_set" "blocked_user_agents_custom" {
      + arn        = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "azul-blocked_user_agents_custom-dev"
      + scope      = "REGIONAL"
      + tags       = {
          + "Name"                = "azul-blocked_user_agents_custom"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents_custom"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all   = {
          + "Name"                = "azul-blocked_user_agents_custom"
          + "billing"             = "hca"
          + "component"           = "azul-blocked_user_agents_custom"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
    }
```